//
//  DataStore.swift
//  ContactList
//
//  Created by Alexey Manokhin on 01.03.2023.
//

final class DataStore {
    
    static let shared = DataStore()
    
    let names = [
        "Алексей",
        "Сергей",
        "Иван",
        "Андрей",
        "Олег",
        "Максим",
        "Константин",
        "Александр",
        "Игорь",
        "Николай",
        "Юрий",
        "Владимир",
        "Евгений",
        "Фёдор",
        "Артём",
        "Дмитрий",
        "Леонид"
    ]
    let surnames = [
        "Юайкитов",
        "Свифтюаев",
        "Сторибордов",
        "Стринговский",
        "Тейблвьюев",
        "Датасорсин",
        "Булинов",
        "Инкапсуляев",
        "Наследин",
        "Полиморфизмов",
        "Абстрактин",
        "Кордатов",
        "Ретёрнов",
        "Ифэлсов",
        "Айосин",
        "Труфолсов",
        "Нилов"
    ]
    let phoneNumbers = [
        "+7(999)000-00-11",
        "+7(909)249-09-94",
        "+7(984)348-73-29",
        "+7(914)558-43-58",
        "+7(924)598-43-69",
        "+7(909)432-48-78",
        "+7(909)723-05-95",
        "+7(932)856-54-66",
        "+7(984)732-54-83",
        "+7(934)439-59-44",
        "+7(942)435-43-56",
        "+7(909)454-38-78",
        "+7(909)723-87-84",
        "+7(932)616-54-66",
        "+7(984)732-54-87",
        "+7(934)439-59-00",
        "+7(942)435-46-50",
    ]
    let emailAddress = [
        "423fds4@mail.ru",
        "oghfodh@gmail.com",
        "rehrrh@yandex.ru",
        "f3odfj@gmail.com",
        "roihewi@mail.ru",
        "fdskhf@yandex.ru",
        "lghfsl@list.ru",
        "4234@mail.ru",
        "oghfodh@gmail.com",
        "rehrrh@yandex.ru",
        "f3odfj@gmail.com",
        "fgdf@mail.ru",
        "gdfgwe@yandex.ru",
        "765543@list.ru",
        "8768jg@mail.ru",
        "jghjgf657@gmail.com",
        "utyrfu43@yandex.ru"
    ]
    
    private init() {}
    
}
