//
//  DataStore.swift
//  ContactList
//
//  Created by Alexey Manokhin on 01.03.2023.
//

class DataStore {
    let names = [
        "Алексей",
        "Сергей",
        "Иван",
        "Андрей",
        "Олег",
        "Максим",
        "Константин",
        "Александр",
        "Игорь",
        "Николай",
        "Юрий",
        "Владимир",
        "Евгений",
        "Фёдор",
        "Артём",
        "Дмитрий",
        "Леонид"
    ]
    let surnames = [
        "Юайкитов",
        "Свифтюаев",
        "Сторибордов",
        "Стринговский",
        "Тейблвьюев",
        "Датасорсин",
        "Булинов",
        "Инкапсуляев",
        "Наследин",
        "Полиморфизмов",
        "Абстрактин",
        "Кордатов",
        "Ретёрнов",
        "Ифэлсов",
        "Айосин",
        "Труфолсов",
        "Нилов"
    ]
    let phoneNumbers = [
    "+79990000011",
    "+79092490994",
    "+79843487329",
    "+79145584358",
    "+79245984369",
    "+79094324878",
    "+79097230595",
    "+79328565466",
    "+79847325483",
    "+79344395944",
    "+79424354356",
    "+79094543878",
    "+79097238784",
    "+79326665466",
    "+79847325487",
    "+79344395900",
    "+79424354650",
    ]
    let emailAddress = [
    "4234@mail.ru",
    "oghfodh@gmail.com",
    "rehrrh@yandex.ru",
    "f3odfj@gmail.com",
    "roihewi@mail.ru",
    "fdskhf@yandex.ru",
    "lghfsl@list.ru",
    "4234@mail.ru",
    "oghfodh@gmail.com",
    "rehrrh@yandex.ru",
    "f3odfj@gmail.com",
    "fgdf@mail.ru",
    "gdfgwe@yandex.ru",
    "765543@list.ru",
    "8768jg@mail.ru",
    "jghjgf657@gmail.com",
    "utyrfu43@yandex.ru"
    ]
}
